Ran Plan for dir: `poc/dev/fulfillment` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_secret_manager_secret_version.basic_auth_pass_v1 must be replaced
-/+ resource "google_secret_manager_secret_version" "basic_auth_pass_v1" {
      ~ create_time  = "2020-11-23T02:56:18.232343Z" -> (known after apply)
      + destroy_time = (known after apply)
        enabled      = true
      ~ id           = "***********************************************************" -> (known after apply)
      ~ name         = "projects/258624793519/secrets/FC_BASIC_AUTH_PASS/versions/1" -> (known after apply)
        secret       = "projects/ccai-df-mva-lab1/secrets/FC_BASIC_AUTH_PASS"
      ~ secret_data  = (sensitive value)
    }

  # google_secret_manager_secret_version.client_api_key_v1 must be replaced
-/+ resource "google_secret_manager_secret_version" "client_api_key_v1" {
      ~ create_time  = "2020-11-23T02:56:18.149588Z" -> (known after apply)
      + destroy_time = (known after apply)
        enabled      = true
      ~ id           = "**********************************************************" -> (known after apply)
      ~ name         = "projects/258624793519/secrets/FC_CLIENT_API_KEY/versions/1" -> (known after apply)
        secret       = "projects/ccai-df-mva-lab1/secrets/FC_CLIENT_API_KEY"
      ~ secret_data  = (sensitive value)
    }

  # random_password.FC_BASIC_AUTH_PASS must be replaced
-/+ resource "random_password" "FC_BASIC_AUTH_PASS" {
      ~ id          = "****" -> (known after apply)
        keepers     = {
            "version" = "1"
        }
      ~ length      = 64 -> 20
        lower       = true
        min_lower   = 0
        min_numeric = 0
        min_special = 0
        min_upper   = 0
        number      = true
      ~ result      = (sensitive value)
        special     = true
        upper       = true
    }

  # random_password.FC_CLIENT_API_KEY must be replaced
-/+ resource "random_password" "FC_CLIENT_API_KEY" {
      ~ id          = "****" -> (known after apply)
        keepers     = {
            "version" = "1"
        }
      ~ length      = 64 -> 128
        lower       = true
        min_lower   = 0
        min_numeric = 0
        min_special = 0
        min_upper   = 0
        number      = true
      ~ result      = (sensitive value)
      ~ special     = true -> false
        upper       = true
    }

Plan: 4 to add, 0 to change, 4 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d poc/dev/fulfillment`
* :put_litter_in_its_place: To **delete** this plan click [here](http://35.193.191.10:4141/lock?id=tandonc%252Fterraform-google-ccai%252Fpoc%252Fdev%252Ffulfillment%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d poc/dev/fulfillment`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
